[
    {
      "bookId": 1,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/N1LSFZm/book-01.jpg",
      "review": "To Kill a Mockingbird is a timeless masterpiece that delves deep into the complexities of racism, morality, and justice in a small Southern town. Through the innocent eyes of Scout Finch, Harper Lee paints a vivid picture of a society riddled with prejudice and intolerance. The trial of Tom Robinson, a black man falsely accused of raping a white woman, serves as the central focus, exposing the harsh realities of bigotry and discrimination. As Atticus Finch, Scout's father and a principled lawyer, fights tirelessly for justice, the novel challenges readers to confront their own beliefs and values. With its rich characterization and poignant narrative, To Kill a Mockingbird continues to resonate with readers, offering profound insights into the human condition.",
      "totalPages": 336,
      "rating": 4.5,
      "categories": ["Fiction", "Legal Drama"],
      "tags": ["Southern", "Coming of Age"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 2,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/H4C0L6M/book-02.jpg",
      "review": "George Orwell's 1984 is a haunting portrayal of a dystopian society ruled by totalitarianism and surveillance. Set in a future where individuality is suppressed and dissent is punished, the novel follows Winston Smith, a low-ranking member of the ruling Party, as he rebels against the oppressive regime. Through Winston's journey of defiance and disillusionment, Orwell explores profound themes of freedom, truth, and the power of language. The omnipresent Big Brother, the Thought Police, and the concept of doublethink serve as chilling reminders of the dangers of unchecked authority and propaganda. As Winston grapples with the consequences of his rebellion, 1984 leaves readers questioning the nature of truth and the fragility of liberty in the face of tyranny.",
      "totalPages": 328,
      "rating": 4.7,
      "categories": ["Science Fiction", "Political Satire"],
      "tags": ["Dystopian", "Social Commentary"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 3,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/rtS2V0F/book-03.jpg",
      "review": "Jane Austen's Pride and Prejudice is a delightful romantic comedy that transcends time and remains a beloved classic. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the intricacies of society and love. When the proud and enigmatic Mr. Darcy enters her life, Elizabeth's prejudices are challenged, leading to a captivating dance of wit and misunderstanding. As the Bennet sisters navigate the pitfalls of courtship and matrimony, Austen skillfully explores themes of class, reputation, and the nature of true love. With its sparkling dialogue, vivid characters, and irresistible charm, Pride and Prejudice continues to enchant readers with its timeless portrayal of the human heart.",
      "totalPages": 432,
      "rating": 4.8,
      "categories": ["Romance", "Classic Literature"],
      "tags": ["Regency", "Humor"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 4,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/Yb8Khc4/book-04.jpg",
      "review": "J.D. Salinger's The Catcher in the Rye is a poignant coming-of-age story that captures the angst and alienation of adolescence with honesty and sensitivity. Narrated by the rebellious and disillusioned Holden Caulfield, the novel follows his journey through New York City after being expelled from prep school. As Holden grapples with feelings of loneliness, loss, and disillusionment with the adult world, he embarks on a quest for authenticity and connection. Through Holden's distinctive voice and stream-of-consciousness narrative, Salinger paints a vivid portrait of youth in revolt, exploring themes of identity, innocence, and the search for meaning in a superficial society. With its raw emotion and unflinching honesty, The Catcher in the Rye remains a timeless classic that resonates with readers of all generations.",
      "totalPages": 224,
      "rating": 4.3,
      "categories": ["Fiction", "Young Adult"],
      "tags": ["Youth", "Cultural Critique"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 5,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/jrkNjFJ/book-05.jpg",
      "review": "F. Scott Fitzgerald's The Great Gatsby is a timeless tale of love, longing, and the pursuit of the American Dream set against the backdrop of the Roaring Twenties. Through the eyes of Nick Carraway, a young man from the Midwest drawn into the glamorous world of Long Island's elite, Fitzgerald paints a vivid portrait of Jay Gatsby, a mysterious millionaire with a tragic past. As Gatsby's obsession with the beautiful Daisy Buchanan unfolds, the novel explores themes of wealth, class, and the emptiness of materialism. With its lyrical prose and evocative imagery, The Great Gatsby captures the spirit of an era defined by excess and disillusionment, leaving readers mesmerized by its tragic beauty.",
      "totalPages": 180,
      "rating": 4.6,
      "categories": ["Fiction", "Romance"],
      "tags": ["Roaring Twenties", "Love Story"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
        "bookId": 6,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/fNMpByp/book-06.jpg",
        "review": "J.R.R. Tolkien's The Lord of the Rings is an epic fantasy masterpiece that transports readers to the enchanting world of Middle-earth. Set against the backdrop of a cosmic struggle between good and evil, the novel follows Frodo Baggins, a humble hobbit tasked with destroying the One Ring, a powerful artifact coveted by the dark lord Sauron. Joined by a fellowship of diverse allies, including humans, elves, dwarves, and wizards, Frodo embarks on a perilous quest across Middle-earth to Mount Doom, the only place where the Ring can be destroyed. Along the way, they encounter epic battles, ancient prophecies, and unforgettable characters, weaving a rich tapestry of adventure, friendship, and heroism. With its immersive world-building and timeless themes of courage and sacrifice, The Lord of the Rings continues to captivate readers of all ages, inspiring generations with its message of hope and redemption.",
        "totalPages": 1178,
        "rating": 4.9,
        "categories": ["Fantasy", "Adventure"],
        "tags": ["Magic", "Quest"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1954
      },
      {
        "bookId": 7,
        "bookName": "Harry Potter and the Philosopher's Stone",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/470mMGW/book-07.jpg",
        "review": "J.K. Rowling's Harry Potter and the Philosopher's Stone marks the beginning of a magical journey into the wizarding world. Follow the young wizard Harry Potter as he discovers his true heritage and attends Hogwarts School of Witchcraft and Wizardry. Alongside his loyal friends Ron Weasley and Hermione Granger, Harry learns about the power of friendship, bravery, and the importance of standing up against evil. As Harry unravels the mystery surrounding the Sorcerer's Stone and confronts the dark wizard Voldemort, readers are transported to a realm of enchantment and adventure. With its whimsical charm, endearing characters, and captivating storyline, Harry Potter and the Philosopher's Stone captures the imagination and reminds us of the enduring magic of childhood.",
        "totalPages": 320,
        "rating": 4.7,
        "categories": ["Fantasy", "Children's Literature"],
        "tags": ["Magic", "Friendship"],
        "publisher": "Bloomsbury Publishing",
        "yearOfPublishing": 1997
      },
      {
        "bookId": 8,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/TWRFQsC/book-08.jpg",
        "review": "J.R.R. Tolkien's The Hobbit is a timeless tale of adventure and heroism that introduces readers to the enchanting world of Middle-earth. Follow Bilbo Baggins, a reluctant hobbit, as he embarks on an epic quest to reclaim the lost kingdom of Erebor and its treasure from the fearsome dragon Smaug. Joined by a company of dwarves and the wise wizard Gandalf, Bilbo encounters trolls, elves, goblins, and other fantastical creatures along the way. As Bilbo discovers courage and resourcefulness within himself, he becomes an unlikely hero in a world teeming with danger and wonder. With its charming prose, vivid imagery, and memorable characters, The Hobbit captures the imagination and transports readers to a realm of adventure and discovery.",
        "totalPages": 310,
        "rating": 4.7,
        "categories": ["Fantasy", "Adventure"],
        "tags": ["Quest", "Dragon"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
      },
      {
        "bookId": 9,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "https://i.ibb.co/drTwL3g/book-09.jpg",
        "review": "Dan Brown's The Da Vinci Code is a gripping mystery thriller that takes readers on a heart-pounding journey through art, religion, and secret societies. When renowned symbologist Robert Langdon is summoned to the Louvre Museum to investigate a murder, he uncovers a trail of cryptic clues that lead to a startling discovery. With the help of cryptologist Sophie Neveu, Langdon races against time to unravel the truth behind a centuries-old conspiracy that could shake the foundations of Christianity. As they follow a trail of hidden messages left by Leonardo da Vinci, Langdon and Neveu find themselves drawn into a web of deception and danger, pursued by shadowy forces determined to protect a secret that could change the course of history. With its intricate plot, fast-paced action, and thought-provoking themes, The Da Vinci Code is a thrilling read that will keep you guessing until the very end.",
        "totalPages": 454,
        "rating": 4.2,
        "categories": ["Mystery", "Thriller"],
        "tags": ["Conspiracy", "Symbolism"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
      }
]